3D U-Net Segmentation
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to
==================================================================================================
Input_Image (InputLayer)        (None, None, None, N 0
__________________________________________________________________________________________________
conv1a (Conv3D)                 (None, None, None, N 896         Input_Image[0][0]
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, None, None, N 128         conv1a[0][0]
__________________________________________________________________________________________________
activation_1 (Activation)       (None, None, None, N 0           batch_normalization_1[0][0]
__________________________________________________________________________________________________
conv1b (Conv3D)                 (None, None, None, N 55360       activation_1[0][0]
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, None, None, N 256         conv1b[0][0]
__________________________________________________________________________________________________
activation_2 (Activation)       (None, None, None, N 0           batch_normalization_2[0][0]
__________________________________________________________________________________________________
pool1 (MaxPooling3D)            (None, None, None, N 0           activation_2[0][0]
__________________________________________________________________________________________________
conv2a (Conv3D)                 (None, None, None, N 110656      pool1[0][0]
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, None, None, N 256         conv2a[0][0]
__________________________________________________________________________________________________
activation_3 (Activation)       (None, None, None, N 0           batch_normalization_3[0][0]
__________________________________________________________________________________________________
conv2b (Conv3D)                 (None, None, None, N 221312      activation_3[0][0]
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, None, None, N 512         conv2b[0][0]
__________________________________________________________________________________________________
activation_4 (Activation)       (None, None, None, N 0           batch_normalization_4[0][0]
__________________________________________________________________________________________________
pool2 (MaxPooling3D)            (None, None, None, N 0           activation_4[0][0]
__________________________________________________________________________________________________
conv3a (Conv3D)                 (None, None, None, N 442496      pool2[0][0]
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, None, None, N 512         conv3a[0][0]
__________________________________________________________________________________________________
activation_5 (Activation)       (None, None, None, N 0           batch_normalization_5[0][0]
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, None, None, N 0           activation_5[0][0]
__________________________________________________________________________________________________
conv3b (Conv3D)                 (None, None, None, N 884992      dropout_1[0][0]
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, None, None, N 1024        conv3b[0][0]
__________________________________________________________________________________________________
activation_6 (Activation)       (None, None, None, N 0           batch_normalization_6[0][0]
__________________________________________________________________________________________________
pool3 (MaxPooling3D)            (None, None, None, N 0           activation_6[0][0]
__________________________________________________________________________________________________
conv4a (Conv3D)                 (None, None, None, N 1769728     pool3[0][0]
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, None, None, N 1024        conv4a[0][0]
__________________________________________________________________________________________________
activation_7 (Activation)       (None, None, None, N 0           batch_normalization_7[0][0]
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, None, None, N 0           activation_7[0][0]
__________________________________________________________________________________________________
conv4b (Conv3D)                 (None, None, None, N 3539456     dropout_2[0][0]
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, None, None, N 2048        conv4b[0][0]
__________________________________________________________________________________________________
activation_8 (Activation)       (None, None, None, N 0           batch_normalization_8[0][0]
__________________________________________________________________________________________________
up4 (UpSampling3D)              (None, None, None, N 0           activation_8[0][0]
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, None, None, N 0           up4[0][0]
                                                                 activation_6[0][0]
__________________________________________________________________________________________________
conv5a (Conv3D)                 (None, None, None, N 5308672     concatenate_1[0][0]
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, None, None, N 1024        conv5a[0][0]
__________________________________________________________________________________________________
activation_9 (Activation)       (None, None, None, N 0           batch_normalization_9[0][0]
__________________________________________________________________________________________________
conv5b (Conv3D)                 (None, None, None, N 1769728     activation_9[0][0]
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, None, None, N 1024        conv5b[0][0]
__________________________________________________________________________________________________
activation_10 (Activation)      (None, None, None, N 0           batch_normalization_10[0][0]
__________________________________________________________________________________________________
up5 (UpSampling3D)              (None, None, None, N 0           activation_10[0][0]
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, None, None, N 0           up5[0][0]
                                                                 activation_4[0][0]
__________________________________________________________________________________________________
conv6a (Conv3D)                 (None, None, None, N 1327232     concatenate_2[0][0]
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, None, None, N 512         conv6a[0][0]
__________________________________________________________________________________________________
activation_11 (Activation)      (None, None, None, N 0           batch_normalization_11[0][0]
__________________________________________________________________________________________________
conv6b (Conv3D)                 (None, None, None, N 442496      activation_11[0][0]
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, None, None, N 512         conv6b[0][0]
__________________________________________________________________________________________________
activation_12 (Activation)      (None, None, None, N 0           batch_normalization_12[0][0]
__________________________________________________________________________________________________
up6 (UpSampling3D)              (None, None, None, N 0           activation_12[0][0]
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, None, None, N 0           up6[0][0]
                                                                 activation_2[0][0]
__________________________________________________________________________________________________
conv7a (Conv3D)                 (None, None, None, N 331840      concatenate_3[0][0]
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, None, None, N 256         conv7a[0][0]
__________________________________________________________________________________________________
activation_13 (Activation)      (None, None, None, N 0           batch_normalization_13[0][0]
__________________________________________________________________________________________________
conv7b (Conv3D)                 (None, None, None, N 55328       activation_13[0][0]
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, None, None, N 128         conv7b[0][0]
__________________________________________________________________________________________________
activation_14 (Activation)      (None, None, None, N 0           batch_normalization_14[0][0]
__________________________________________________________________________________________________
PredictionMask (Conv3D)         (None, None, None, N 33          activation_14[0][0]
==================================================================================================
Total params: 16,269,441
Trainable params: 16,264,833
Non-trainable params: 4,608
